{
    "HomePage": {
        "ImagePart": {
            "title": "Дем'ян Ільницький",
            "description1": "Я",
            "description2": "молодший Flutter-розробник",
            "description3": "створюю інтуїтивно зрозумілі, високопродуктивні",
            "description4": "кросплатформенні",
            "description5": "додатки, що забезпечують безперебійний користувацький досвід."
        },
        "AboutMe": {
            "title": "Про мене",
            "paragraph1": {
                "part1": "Я —",
                "part2": "молодший Flutter-розробник",
                "part3": "із пристрастю до створення",
                "part4": "інтуїтивно зрозумілих",
                "part5": "мобільних та веб-додатків. Маю практичний досвід роботи з",
                "part6": "back-end технологіями",
                "part7": ", такими як Firebase та JavaScript з PostgreSQL, що дозволяє мені створювати",
                "part8": "комплексні та надійні рішення",
                "part9": ". Моя мета — розробляти високопродуктивні додатки, які забезпечують бездоганний користувацький досвід."
            },
            "paragraph2": {
                "part1": "За час своєї кар'єри я успішно реалізовував проєкти різного масштабу — від невеликих утиліт до великих систем. Маю значний досвід у",
                "part2": "виправленні помилок",
                "part3": "та",
                "part4": "оптимізації існуючого функціоналу",
                "part5": ", як на Front-end, так і на Back-end. Крім того, я активно долучався до",
                "part6": "перевірки коду",
                "part7": "(code review) та",
                "part8": "навчання нових членів команди",
                "part9": ", сприяючи їхньому професійному зростанню."
            },
            "paragraph3": {
                "part1": "Мої навички охоплюють широкий спектр технологій та інструментів, включаючи",
                "part2": "GitHub Workflow, Cloudflare, AWS, Stripe, Google Play Console, App Store Connect, Firebase Functions, SendGrid, Algolia",
                "part3": ". Також маю досвід у розробці",
                "part4": "Next.js веб-додатків",
                "part5": ", що доповнює мою експертизу в сучасному веброзробці."
            }
        },
        "WorkExperience": {
            "title": "Досвід роботи",
            "fullList": "Повний список",
            "jobs": [
                {
                    "title": "Додаток Flutter для українських ветеранів з бізнес-порталом",
                    "position": "Розробник Flutter та Next.js",
                    "period": "Травень 2024 - По теперішній час",
                    "description": "Додаток на Flutter для українських ветеранів з мобільними (Android/iOS) та веб-платформами, зручним дизайном, що централізує знижки. Включає бізнес-офіс для компаній для управління пропозиціями, сприяючи підтримці громади та доступу до пільг.",
                    "skills": [
                        "Flutter",
                        "Firebase",
                        "Next.js",
                        "GitHub Actions",
                        "JavaScript",
                        "Python"
                    ]
                },
                {
                    "title": "Покращення додатка Liva Clinic",
                    "position": "Розробник Flutter та back-end",
                    "period": "Жовтень 2024 - Квітень 2025",
                    "description": "Покращив додаток на Flutter та бекенд на PostgreSQL/Sequelize, усунувши помилки та додавши нові функції. Використовував AWS для стабільності бекенду, забезпечуючи надійну роботу системи.",
                    "skills": [
                        "Flutter",
                        "JavaScript",
                        "PostgreSQL",
                        "Stripe Connect",
                        "SendGrid",
                        "GitHub Actions",
                        "Agora"
                    ]
                }
            ]
        },
        "Connect": {
            "title": "Зв'яжіться зі мною",
            "description": "Знайдіть мене в соціальних мережах.",
            "social": [
                {
                    "title": "Електронна пошта",
                    "description": "demian.ilnytskyi@gmail.com"
                },
                {
                    "title": "LinkedIn",
                    "description": "demian-ilnytskyi-54367a268"
                },
                {
                    "title": "GitHub",
                    "description": "demian-ilnytskyi"
                }
            ]
        },
        "ContactForm": {
            "title": "Напишіть мені",
            "description": "Маєте запитання чи ідею для співпраці? Заповніть форму нижче, і я зв’яжуся з вами якнайшвидше!",
            "nameLabel": "Ім’я",
            "emailLabel": "Електронна пошта",
            "messageLabel": "Повідомлення",
            "namePlaceholder": "Ваше ім’я",
            "emailPlaceholder": "Ваша електронна пошта",
            "messagePlaceholder": "Ваше повідомлення",
            "nameError": "Будь ласка, введіть ваше ім’я.",
            "emailError": "Будь ласка, введіть вашу електронну пошту.",
            "emailFormatError": "Будь ласка, введіть дійсну адресу електронної пошти.",
            "messageError": "Будь ласка, введіть ваше повідомлення.",
            "submitButton": "Надіслати повідомлення",
            "successMessage": "Дякую за ваше повідомлення! Я зв’яжуся з вами незабаром.",
            "errorMessage": "Сталася помилка під час надсилання повідомлення. Спробуйте ще раз пізніше або зв’яжіться зі мною через соціальні мережі."
        }
    },
    "ProjectsPage": {
        "title": "Мої проєкти",
        "details": "Детальніше"
    },
    "ProjectPage": {
        "links": "Посилання",
        "emptyLinks": "Наразі я не можу надати прямі посилання на цей проєкт, але, будь ласка, зв'яжіться зі мною для отримання додаткової інформації.",
        "backToProjects": "До проєктів"
    },
    "Projects": {
        "veteranam-info": {
            "title": "Ветеранам Інфо",
            "description": "Додаток централізує знижки та пропозиції для ветеранів війни в Україні, пріоритезуючи простоту використання та інклюзивність для всіх рівнів технічних навичок. Розроблений на Flutter, він включає мобільні (Android/iOS) та веб-версії, створені з урахуванням доступності. Бізнес-кабінет дозволяє компаніям самостійно керувати своїми пропозиціями знижок, оптимізуючи процес для ветеранів та постачальників послуг. Платформа об'єднує ветеранів з бізнесами, посилюючи підтримку в громаді та покращуючи доступ до пільг.",
            "period": "Травень 2024 - По теперішній час"
        },
        "check-my-building": {
            "title": "Check My Building",
            "description": "Check My Building — це мобільний додаток, створений за допомогою Flutter для оптимізації аудиту та покращення інспекцій будинків. Додаток містить фотопідтвердження, оновлення в реальному часі, коментарі до окремих елементів та інструменти для планування аудитів, розподілу обов'язків і створення власних шаблонів. Завдяки заміні звітів електронною поштою на це спеціалізоване рішення, бізнес підвищив ефективність, покращив відстеження та зменшив адміністративне навантаження, що зрештою заощадило час та підвищило операційну ясність.",
            "period": "Жовтень 2024 - Травень 2024"
        },
        "liva-clinic": {
            "title": "Liva Clinic",
            "description": "Liva Clinic — це комплексна медична платформа, розроблена як для лікарів, так і для пацієнтів. Вона дозволяє користувачам реєструватися в будь-якій з цих ролей, бронювати або пропонувати зустрічі, а також проводити консультації онлайн або офлайн. Завдяки інтегрованим онлайн-платежам, нагадуванням про сповіщення та оновленням у реальному часі, платформа забезпечує безперебійний та доступний медичний досвід на мобільних пристроях та в Інтернеті. Створена за допомогою Flutter для послідовного кросплатформного інтерфейсу та на базі спеціального JavaScript бекенду на AWS, Liva Clinic оптимізує управління медичними взаємодіями для всіх користувачів.",
            "period": "Жовтень 2024 - Квітень 2025"
        },
        "hunger-quest": {
            "title": "Hunger Quest",
            "description": "Працював як фріланс-розробник для агентства, використовуючи FlutterFlow. Брав участь у створенні та вдосконаленні різних функцій, включаючи реалізацію функціоналу для додавання та редагування інформації про вантажівки, завантаження та відображення елементів з Firebase у вигляді списку, інтеграцію Google Maps для вибору місцезнаходження, підтримку двох різних ролей користувачів з окремим доступом та поведінкою, а також інтеграцію Stripe для обробки платежів, включаючи пробний період для користувачів.",
            "period": "Травень 2025 - По теперішній час"
        },
        "ice-cream-time": {
            "title": "Ice Cream Time",
            "description": "Ice Cream Time — це мобільний додаток для фургонів з морозивом, розроблений на Flutter. Додаток дозволяє користувачам переглядати фургони на карті в реальному часі, підтримує різні ролі користувачів та використовує background location для автоматичної передачі координат продавців і надсилання push-сповіщень клієнтам, коли фургон знаходиться поруч.",
            "period": "Липень 2025 - По теперішній час"
        }
    },
    "NotFound": {
        "General": {
            "title": "Сторінка не знайдена",
            "description": "Можливо, ця сторінка була видалена, переміщена або ви просто помилилися посиланням.",
            "goToHomePage": "До головної"
        },
        "Metadata": {
            "General": {
                "title": "Сторінка не знайдена",
                "description": "Можливо, ця сторінка була видалена, переміщена або ви просто помилилися посиланням."
            }
        }
    },
    "Metadata": {
        "Main": {
            "category": "Портфоліо",
            "title": {
                "default": "Дем'ян Ільницький - Портфоліо молодшого Flutter Розробника",
                "template": "%s | Дем'ян Ільницький"
            },
            "description": "Дем'ян Ільницький — молодшого Flutter Розробник, що спеціалізується на створенні інтуїтивно зрозумілих, високопродуктивних кросплатформних мобільних та веб-додатків. Завдяки досвіду у Flutter, Next.js, Firebase, PostgreSQL та ряду серверних технологій, він надає комплексні та безперебійні користувацькі інтерфейси, підкріплені досвідом у виправленні помилок, оптимізації та рев'ю коду."
        },
        "Projects": {
            "title": "Проекти молодшого Flutter Розробника",
            "description": "Дем'ян Ільницький — молодший Flutter Розробник, що спеціалізується на створенні інтуїтивно зрозумілих, високопродуктивних кросплатформних мобільних та веб-додатків. Завдяки досвіду у Flutter, Next.js, Firebase, PostgreSQL та ряду серверних технологій, він надає комплексні та безперебійні користувацькі інтерфейси, підкріплені досвідом у виправленні помилок, оптимізації та рев'ю коду."
        }
    },
    "NavigationBar": {
        "logo": "Дем'ян Ільницький",
        "home": "Головна",
        "aboutMe": "Про мене",
        "workExperience": "Досвід роботи",
        "connect": "зв’язатися",
        "lightMode": "Перейти на світлу тему",
        "darkMode": "Перейти на темну тему",
        "ukSwitcherLabel": "Змінити мову на українську",
        "enSwitcherLabel": "Змінити мову на англійську",
        "dialogLabel": "Меню навігації"
    },
    "Footer": {
        "content": "Дем'ян Ільницький. Усі права захищені.",
        "viewSource": "Переглянути джерело"
    }
}